{"_name_or_path": "bert-base-uncased", "architectures": ["BertForTokenClassification"], "attention_probs_dropout_prob": 0.1, "classifier_dropout": null, "gradient_checkpointing": false, "hidden_act": "gelu", "hidden_dropout_prob": 0.1, "hidden_size": 768, "id2label": {"0": "O", "1": "B-PERSON", "2": "I-PERSON", "3": "B-ORG", "4": "I-ORG", "5": "B-GPE", "6": "I-GPE", "7": "B-PRODUCT", "8": "I-PRODUCT"}, "initializer_range": 0.02, "intermediate_size": 3072, "label2id": {"O": "0", "B-PERSON": "1", "I-PERSON": "2", "B-ORG": "3", "I-ORG": "4", "B-GPE": "5", "I-GPE": "6", "B-PRODUCT": "7", "I-PRODUCT": "8"}, "layer_norm_eps": 1e-12, "max_position_embeddings": 512, "model_type": "bert", "num_attention_heads": 12, "num_hidden_layers": 12, "pad_token_id": 0, "position_embedding_type": "absolute", "torch_dtype": "float32", "transformers_version": "4.41.1", "type_vocab_size": 2, "use_cache": true, "vocab_size": 30522}